#include <iostream>
#include "person.h"

int main(){
    /*
    Задача 1: Създайте статична и динамична библиотека, в която да има следните функционалности:
    
    Да се създаде структура човек. Той ще съдържа име(динамично заделен низ), години и пол(Man/Woman/Unknown).
    Да се създадат функции за инициализиране и изтриване на човек.
    Да се създаде функция за говорене, с един параметър символен низ(който ще се "изговори").
    Да се създаде функция за принтиране на информацията на човек.
    Всичката функционалност трябва да се намира в namespace Person.
    */
   Person::Person person;
   char name[] = "sosko\n";
   std::cout << name;
   person.InitPerson(name, 12, Person::Person::Gender::Male);
   person.PrintInfo();
   person.DeletePerson();
}